export const ru = {
    translation: {
        'footer': {
            'info': {
                'title': 'Юридическая информация',
                'ul': {
                    1: 'Политика конфиденциальности',
                    2: 'Условия использования',
                    3: 'Политика в отношении файлов cookie'
                }
            },
            'contacts': {
                'title': 'Социальные сети',
            },
            'help': {
                'title': 'Помощь',
                'ul': {
                    1: 'О нас',
                    2: 'Частые вопросы',
                    3: 'Контакты'
                }
            }
        },
        'main': {
            'search': 'Поиск',
            'text': {
                1: 'это больше, чем просто сайт знакомств; это платформа для значимых связей.',
                2: 'Если вы ищете нового друга, случайное свидание или долгосрочного партнера, это идеальное место для начала.',
                3: 'Мы упрощаем поиск людей, которые разделяют ваши увлечения, ценности и образ жизни.'
            }
        },
        'login': {
            'title': 'или',
            'auth': {
                'title': 'Войдите',
                'inputs': {
                    1: 'Логин',
                    2: 'Пароль',
                },
                'button': 'Войти',
                'link': 'Забыли пароль?'
            },
            'reg': {
                'title': 'Создайте новый аккаунт',
                'inputs': {
                    1: 'Email',
                    2: 'Имя',
                    3: 'Пароль',
                    4: 'Повторите пароль'
                },
                'button': 'Зарегистрироваться',
                'checkbox': 'Согласен с Условиями сайта. Чтобы узнать, как мы обрабатываем ваши данные, ознакомьтесь с нашей Политика конфиденциальности и Политика в отношениях файлов  Cookie.'
            }
        }
    },
    'zod': {
        'required': 'Это поле обязательно',
        'passwords_not_match': 'Пароли должны совпадать',
        'min': 'Минимальная длина {{number}} символов',
        'email': 'Неверный email'
    }
};